app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
        @posts = Post.all
---
INSERT INTO "posts" ("body", "created_at", "titke", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", ""], ["created_at", "2014-11-14 18:44:04.355081"], ["titke", ""], ["updated_at", "2014-11-14 18:44:04.355081"]]
SELECT "posts".* FROM "posts"